app/controllers/artists_controller.rb

  def index
    @songs = Song.order('listeners DESC')
    @artists = Artist.order('listeners DESC')
---
SELECT "songs".* FROM "songs" ORDER BY listeners DESC
SELECT "artists".* FROM "artists" ORDER BY listeners DESC